// Задание 1
/* Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for выведите все эти
элементы на экран.*/
/*let arr = [ 1, 2, 3, 4, 5, ];
for( let i = 0; i < arr.length; i++){
console.log(arr [i]);
}*/

// Задание 2
/* Дан массив с числами [-2, -1, -3, 15, 0, -4, 2, -5, 9, -15, 0, 4, 5, -6, 10, 7]. Числа могут
быть положительными и отрицательными. Выведите на экран только отрицательные
числа, которые больше -10, но меньше -3.*/

 let arrNum = [-2, -1, -3, 15, 0, -4, 2, -5, 9, -15, 0, 4, 5, -6, 10, 7];
      num = [15, -2, -1]
      console.log(num)
// Задание 3
/* Создайте новый массив и заполните его значениями от 23 до 57, используя цикл for и
while. Выведите оба массива. С помощью цикла for найдите сумму элементов этого
массива. Запишите ее в переменную result и выведите.*/

sum = 0;
for (let i = 23; i <= 57; i++){
    sum =  sum + i;
    console.log(sum)
}




//Задание 4
/* Дан массив числами (строчного типа), например: [‘10’, ‘20’, ‘30’, ‘50’, ‘235’, ‘3000’].
Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5.*/
/*let arr = ['10', '20', '30', '50', '235', '3000']


for (let i = 0; i < arr.length; i++) {
    let str = String (arr[i]);

    if (str[0] == 1 || str[0] == 2|| str[0] == 5) {

        console.log(str[0])
        
    }
    
}*/
//Задание 5
 let arr =['ПН', 'ВТ', 'СР', 'ЧТ', 'ПТ', 'СБ', 'ВС'];
 for (let i = 0; i<= arr.lenrgth; i++);{
    document.write(arr);

    if (arr [i] == 'СБ' || arr [i] == 'ВС'); {
        document.write(arr[i]);
    }
 }

//Задание 6


//Задание 7

//Задание 8


//Задание 9


//Задание 10
//Задание 11
